src/ex_Tabakon/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/ex_Tabakon/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ДействующиеЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДействующиеЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/CommonModules/ЗапасыСервер/Ext/Module.bsl
Процедура ЗаполнитьОстаткиНоменклатурыБезУчетаХарактеристик(Объект, ИмяТабличнойЧасти, ДатаПоследнегоИнвента = '00010101') Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.Склад
	|ПОМЕСТИТЬ ТаблицаВЗапрос
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ТоварыНаСкладахОстатки.РезервОстаток КАК ОстатокБезРезерва
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			(Номенклатура,  Склад) В
	|				(ВЫБРАТЬ
	|					ТаблицаВЗапрос.Номенклатура,
	|					ТаблицаВЗапрос.Склад
	|				ИЗ
	|					ТаблицаВЗапрос КАК ТаблицаВЗапрос)) КАК ТоварыНаСкладахОстатки";
	
	ТаблицаНоменклатуры = Объект[ИмяТабличнойЧасти].Выгрузить();
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	
	Результат = Запрос.Выполнить();
	ТаблицаОстатков = Результат.Выгрузить();
	
	СтруктураПоиска = Новый Структура;
	МассивОстатков = Новый Массив;
	
	Для каждого СтрокаТаблицыНоменклатуры Из Объект[ИмяТабличнойЧасти] Цикл
		Если не СтрокаТаблицыНоменклатуры.ХарактеристикиИспользуются тогда
	
			СтруктураПоиска.Вставить("Номенклатура"  , СтрокаТаблицыНоменклатуры.Номенклатура);
			СтруктураПоиска.Вставить("Склад"         , СтрокаТаблицыНоменклатуры.Склад);
			
			МассивСтрок = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() > 0  Тогда
				СтрокаТаблицыНоменклатуры.Остаток = МассивСтрок[0].ОстатокБезРезерва;
				МассивСтрок[0].ОстатокБезРезерва = МассивСтрок[0].ОстатокБезРезерва - СтрокаТаблицыНоменклатуры.Количество;
			Иначе
				СтрокаТаблицыНоменклатуры.Остаток = 0;
			КонецЕсли;  		
		КонецЕсли;	 
					
		//Вик 2023-05-31
		Если ЗначениеЗаполнено(ДатаПоследнегоИнвента) тогда
			Запрос	=	Новый запрос("ВЫБРАТЬ
			      	 	             |	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот
			      	 	             |ИЗ
			      	 	             |	РегистрНакопления.Продажи.Обороты(&ДатаНач, , , Номенклатура = &Номенклатура) КАК ПродажиОбороты");
			Запрос.УстановитьПараметр("ДатаНач", ДатаПоследнегоИнвента+1);
			Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицыНоменклатуры.Номенклатура); 
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				СтрокаТаблицыНоменклатуры.Продано = Рез.КоличествоОборот; 
			иначе
				СтрокаТаблицыНоменклатуры.Продано = 0; 
            КонецЕсли;
		КонецЕсли;
		//   

	КонецЦикла;
	
КонецПроцедуры

&Вместо("ЦенаПродажи")
Функция ТБКЦенаПродажи(Магазин, Дата, Номенклатура, Характеристика, Упаковка, ПриводитьКМинимальнойЦене)
	// Вставить содержимое метода.  
  
	УстановитьПривилегированныйРежим(Истина);
	Цена = 0;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ТипНоменклатуры");
		СтруктураРеквизитов.Вставить("Номинал");
		СтруктураРеквизитов.Вставить("ЦеноваяГруппа");
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, СтруктураРеквизитов);
		Если РеквизитыНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
			
			Цена = РеквизитыНоменклатуры.Номинал;
			Если Цена = Неопределено Тогда
				Цена = 0;
			Иначе
				Если ЗначениеЗаполнено(Упаковка) Тогда
					КоэффициентУпаковкиВходящий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Коэффициент");
					Если ЗначениеЗаполнено(КоэффициентУпаковкиВходящий) Тогда
						Цена = Окр(Цена * КоэффициентУпаковкиВходящий, 2);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		
		Иначе
			Если ЗначениеЗаполнено(Магазин) Тогда
				РеквизитыМагазина = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Магазин, "ВидМинимальныхЦенПродажи, ИспользоватьПрименениеЦен, ПравилоЦенообразования, ФорматМагазина");
				ИспользоватьПрименениеЦен = (РеквизитыМагазина.ИспользоватьПрименениеЦен = Истина) И (ПолучитьФункциональнуюОпцию("ИспользоватьПрименениеЦен") = Истина);
				
				ЦенаВыборки = 0;
				УпаковкаЦены = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
				КоэффициентУпаковки = 1;
				
				Если ИспользоватьПрименениеЦен Тогда
				
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	Цены.Упаковка КАК Упаковка,
					|	ЕСТЬNULL(Цены.Упаковка.Коэффициент, 0) КАК КоэффициентУпаковки,
					|	Цены.Цена КАК Цена,
					|	1 КАК Приоритет,
					|	Цены.Период КАК Период
					|ПОМЕСТИТЬ ТаблицаЦен
					|ИЗ
					|	РегистрСведений.ДействующиеЦеныНоменклатуры КАК Цены
					|ГДЕ
					|	Цены.ОбъектЦенообразования = &Магазин
					|	И Цены.Номенклатура = &Номенклатура
					|	И Цены.Характеристика = &Характеристика
					|	И Цены.Период <= &Дата
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	Цены.Упаковка,
					|	ЕСТЬNULL(Цены.Упаковка.Коэффициент, 0),
					|	Цены.Цена,
					|	2,
					|	Цены.Период
					|ИЗ
					|	РегистрСведений.ДействующиеЦеныНоменклатуры КАК Цены
					|ГДЕ
					|	Цены.ОбъектЦенообразования = &Магазин
					|	И Цены.Номенклатура = &Номенклатура
					|	И Цены.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
					|	И Цены.Номенклатура.ВидНоменклатуры.ИспользоватьЦенуНоменклатуры
					|	И Цены.Период <= &Дата
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					|	ТаблицаЦен.Упаковка КАК Упаковка,
					|	ТаблицаЦен.КоэффициентУпаковки КАК КоэффициентУпаковки,
					|	ТаблицаЦен.Цена КАК Цена
					|ИЗ
					|	ТаблицаЦен КАК ТаблицаЦен
					|
					|УПОРЯДОЧИТЬ ПО
					|	ТаблицаЦен.Приоритет,
					|	ТаблицаЦен.Период УБЫВ";  
					
					//Вик 2024-09-27     
					Если Строка(Магазин) = "ЛенинскийТест1.2" тогда
						Магазин	=	Справочники.Магазины.НайтиПоНаименованию("Ленинский2ПДВ");					
					КонецЕсли;
					//  
	
					Запрос.УстановитьПараметр("Дата", Дата);
					Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
					Запрос.УстановитьПараметр("Характеристика", Характеристика);
					Запрос.УстановитьПараметр("Магазин", Магазин);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Если ЗначениеЗаполнено(Выборка.Цена) Тогда
							Если ЗначениеЗаполнено(Выборка.Цена) Тогда
								ЦенаВыборки = Выборка.Цена;
							КонецЕсли;	
							Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
								УпаковкаЦены = Выборка.Упаковка;
							КонецЕсли;
							Если ЗначениеЗаполнено(Выборка.КоэффициентУпаковки) Тогда
								КоэффициентУпаковки = Выборка.КоэффициентУпаковки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
				
					ИспользоватьАссортимент = ПолучитьФункциональнуюОпцию("УстанавливатьВидыЦенВАссортименте")
						И АссортиментСервер.ПолучитьФункциональнуюОпциюКонтроляАссортимента(Магазин);
					ВидЦен = Неопределено;
					
					Если ИспользоватьАссортимент Тогда
						
						Запрос = Новый Запрос;
						
						Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						|	Ассортимент.ВидЦен КАК ВидЦен
						|
						|ИЗ
						|	РегистрСведений.Ассортимент КАК Ассортимент
						|ГДЕ
						|	Ассортимент.Номенклатура = &Номенклатура
						|	И Ассортимент.ОбъектПланирования = &ФорматМагазина
						|	И Ассортимент.Период <= &Дата
						|
						|УПОРЯДОЧИТЬ ПО
						|	Ассортимент.Период УБЫВ
						|";
						Запрос.УстановитьПараметр("ФорматМагазина", РеквизитыМагазина.ФорматМагазина);
						Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
						Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							Если ЗначениеЗаполнено(Выборка.ВидЦен) Тогда
								ВидЦен = Выборка.ВидЦен;
							КонецЕсли;
						КонецЕсли;
					Иначе
						ИспользоватьЦеновыеГруппы = ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");
						Если ИспользоватьЦеновыеГруппы Тогда
							ЦеноваяГруппа = РеквизитыНоменклатуры.ЦеноваяГруппа;
							Если ЗначениеЗаполнено(ЦеноваяГруппа) Тогда
								Запрос = Новый Запрос;
								Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
								|	ЦеновыеГруппы.ВидЦен КАК ВидЦен
								|ИЗ
								|	Справочник.ПравилаЦенообразования.ЦеновыеГруппы КАК ЦеновыеГруппы
								|ГДЕ
								|	ЦеновыеГруппы.Ссылка = &Ссылка
								|	И ЦеновыеГруппы.ЦеноваяГруппа = &ЦеноваяГруппа";
								Запрос.УстановитьПараметр("Ссылка", РеквизитыМагазина.ПравилоЦенообразования);
								Запрос.УстановитьПараметр("ЦеноваяГруппа", ЦеноваяГруппа);
								Выборка = Запрос.Выполнить().Выбрать();
								Если Выборка.Следующий() Тогда
									Если ЗначениеЗаполнено(Выборка.ВидЦен) Тогда
										ВидЦен = Выборка.ВидЦен;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НЕ ЗначениеЗаполнено(ВидЦен) И ЗначениеЗаполнено(РеквизитыМагазина.ПравилоЦенообразования) Тогда
							ВидЦен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыМагазина.ПравилоЦенообразования, "ВидЦен");
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВидЦен) Тогда
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	Цены.Упаковка КАК Упаковка,
						|	ЕСТЬNULL(Цены.Упаковка.Коэффициент, 0) КАК КоэффициентУпаковки,
						|	Цены.Цена КАК Цена,
						|	1 КАК Приоритет,
						|	Цены.Период КАК Период
						|ПОМЕСТИТЬ ТаблицаЦен
						|ИЗ
						|	РегистрСведений.ЦеныНоменклатуры КАК Цены
						|ГДЕ
						|	Цены.ВидЦены = &ВидЦен
						|	И Цены.Номенклатура = &Номенклатура
						|	И Цены.Характеристика = &Характеристика
						|	И Цены.Период <= &Дата
						|
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|	Цены.Упаковка,
						|	ЕСТЬNULL(Цены.Упаковка.Коэффициент, 0),
						|	Цены.Цена,
						|	2,
						|	Цены.Период
						|ИЗ
						|	РегистрСведений.ЦеныНоменклатуры КАК Цены
						|ГДЕ
						|	Цены.ВидЦены = &ВидЦен
						|	И Цены.Номенклатура = &Номенклатура
						|	И Цены.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
						|	И Цены.Номенклатура.ВидНоменклатуры.ИспользоватьЦенуНоменклатуры
						|	И Цены.Период <= &Дата
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						|	ТаблицаЦен.Упаковка КАК Упаковка,
						|	ТаблицаЦен.КоэффициентУпаковки КАК КоэффициентУпаковки,
						|	ТаблицаЦен.Цена КАК Цена
						|ИЗ
						|	ТаблицаЦен КАК ТаблицаЦен
						|
						|УПОРЯДОЧИТЬ ПО
						|	ТаблицаЦен.Приоритет,
						|	ТаблицаЦен.Период УБЫВ";
						
						Запрос.УстановитьПараметр("Дата", Дата);
						Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
						Запрос.УстановитьПараметр("Характеристика", Характеристика);
						Запрос.УстановитьПараметр("ВидЦен", ВидЦен);		
							
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							Если ЗначениеЗаполнено(Выборка.Цена) Тогда
								ЦенаВыборки = Выборка.Цена;
							КонецЕсли;	
							Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
								УпаковкаЦены = Выборка.Упаковка;
							КонецЕсли;
							Если ЗначениеЗаполнено(Выборка.КоэффициентУпаковки) Тогда
								КоэффициентУпаковки = Выборка.КоэффициентУпаковки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ПриводитьКМинимальнойЦене И ЗначениеЗаполнено(РеквизитыМагазина.ВидМинимальныхЦенПродажи) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	Цены.Упаковка КАК Упаковка,
					|	ЕСТЬNULL(Цены.Упаковка.Коэффициент, 0) КАК КоэффициентУпаковки,
					|	Цены.Цена КАК Цена,
					|	1 КАК Приоритет,
					|	Цены.Период КАК Период
					|ПОМЕСТИТЬ ТаблицаЦен
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатуры КАК Цены
					|ГДЕ
					|	Цены.ВидЦены = &ВидМинимальныхЦенПродажи
					|	И Цены.Номенклатура = &Номенклатура
					|	И Цены.Характеристика = &Характеристика
					|	И Цены.Период <= &Дата
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	Цены.Упаковка,
					|	ЕСТЬNULL(Цены.Упаковка.Коэффициент, 0),
					|	Цены.Цена,
					|	2,
					|	Цены.Период
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатуры КАК Цены
					|ГДЕ
					|	Цены.ВидЦены = &ВидМинимальныхЦенПродажи
					|	И Цены.Номенклатура = &Номенклатура
					|	И Цены.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
					|	И Цены.Номенклатура.ВидНоменклатуры.ИспользоватьЦенуНоменклатуры
					|	И Цены.Период <= &Дата
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					|	ТаблицаЦен.Упаковка КАК Упаковка,
					|	ТаблицаЦен.КоэффициентУпаковки КАК КоэффициентУпаковки,
					|	ТаблицаЦен.Цена КАК Цена
					|ИЗ
					|	ТаблицаЦен КАК ТаблицаЦен
					|
					|УПОРЯДОЧИТЬ ПО
					|	ТаблицаЦен.Приоритет,
					|	ТаблицаЦен.Период УБЫВ";
					Запрос.УстановитьПараметр("ВидМинимальныхЦенПродажи", РеквизитыМагазина.ВидМинимальныхЦенПродажи);
					Запрос.УстановитьПараметр("Дата", Дата);
					Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
					Запрос.УстановитьПараметр("Характеристика", Характеристика);
					
					МинимальнаяЦена = 0;
					УпаковкаМинимальнойЦены = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
					КоэффициентМинимальнойЦены = 1;
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Если ЗначениеЗаполнено(Выборка.Цена) Тогда
							МинимальнаяЦена = Выборка.Цена;
						КонецЕсли;	
						Если ЗначениеЗаполнено(Выборка.Упаковка) Тогда
							УпаковкаМинимальнойЦены = Выборка.Упаковка;
						КонецЕсли;
						Если ЗначениеЗаполнено(Выборка.КоэффициентУпаковки) Тогда
							КоэффициентМинимальнойЦены = Выборка.КоэффициентУпаковки;
						КонецЕсли;
					КонецЕсли;
					
					Если ЦенаВыборки > 0 И МинимальнаяЦена > 0 Тогда
						Если УпаковкаМинимальнойЦены = УпаковкаЦены Тогда
							Если ЦенаВыборки < МинимальнаяЦена Тогда
								ЦенаВыборки = МинимальнаяЦена;
								УпаковкаЦены = УпаковкаМинимальнойЦены;
								КоэффициентУпаковки = КоэффициентМинимальнойЦены;
							КонецЕсли;
						Иначе
							Если Окр(ЦенаВыборки / КоэффициентУпаковки, 2) < Окр(МинимальнаяЦена / КоэффициентМинимальнойЦены, 2) Тогда
								ЦенаВыборки = МинимальнаяЦена;
								УпаковкаЦены = УпаковкаМинимальнойЦены;
								КоэффициентУпаковки = КоэффициентМинимальнойЦены;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если УпаковкаЦены = Упаковка Тогда
					Цена = ЦенаВыборки;
				Иначе
					КоэффициентУпаковкиВходящий = ?(ЗначениеЗаполнено(Упаковка), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Коэффициент"), 1);
					Если ЗначениеЗаполнено(КоэффициентУпаковкиВходящий) Тогда
						Цена = Окр(ЦенаВыборки * КоэффициентУпаковкиВходящий / КоэффициентУпаковки, 2);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Цена;

КонецФункции
